{
  "intents": [
    {
      "tag": "errors",
      "patterns": ["", " ", " "],
      "responses": [
        "i can't understand that.",
        "My capability is beyond that one"
      ]
    },
    {
      "tag": " zeae-maydis ",
      "patterns": ["what is zeae-maydis ", "zeae-maydis "],
      "responses": [
        "Cercospora zeae-maydis, commonly known as Cercospora leaf spot, is a fungal pathogen that affects corn (maize) plants. This plant disease primarily manifests as leaf spots on corn leaves."
      ]
    },
    {
      "tag": "greetings",
      "patterns": ["Hello", "hey", "hi"],
      "responses": ["Hello!!", "what now?"]
    },
    {
      "tag": "cnn",
      "patterns": [
        "what is cnn?",
        "what is  Convolutional Neural Network?",
        "what is cnn means?",
        "what is  Convolutional Neural Network anyway?"
      ],
      "responses": [
        "Convolutional Neural Network. It is a type of deep learning algorithm that is primarily used for processing and analyzing visual data, such as images and videos. CNNs are a class of artificial neural networks designed to automatically and adaptively learn spatial hierarchies of features from input data.",
        "Convolutional Neural Network are trained using labeled data to learn the features that are relevant for a specific task, making them highly effective for image analysis tasks like image classification, object detection, and segmentation. They have also been applied to a variety of other domains, including natural language processing and speech recognition, by adapting their architecture for different types of data."
      ]
    },
    {
      "tag": "chat_bot",
      "patterns": [
        "Who are you?",
        "What can you do?",
        " what is your functionality",
        "introduce yourself"
      ],
      "responses": [
        "Hi! I'm your friendly chat bot. I can answer questions related with the corn leaf. This project aims to identify what kind of disease is the corn leaf have and also I'm a part of it. But also i have some error.",
        "Hello there! I'm a helpful chatbot here to assist with questions about corn leaves. This project is focused on determining the specific disease affecting corn leaves, and I'm an integral part of it. However, I do have a few issues to address."
      ]
    },
    {
      "tag": "chat_bot2",
      "patterns": [
        "what is chatbot?",
        "what is chat bot?",
        "Chat bot?",
        "what is chatbot anyway?"
      ],
      "responses": [
        "A chatbot is a computer program or artificial intelligence application designed to conduct a conversation with human users through text or speech interactions. Chatbots are often used to automate customer support, provide information, assist with tasks, and engage in natural language conversations. They can be found in various applications, such as websites, messaging platforms, mobile apps, and even voice-based virtual assistants like Siri and Alexa.",
        "Chatbots use natural language processing (NLP) and machine learning techniques to understand and generate human language. They can be rule-based, where they follow predefined scripts and rules, or they can be more advanced and employ machine learning algorithms to learn from interactions and improve their responses over time.",
        "Chatbots are conversational agents that use natural language processing to communicate with users."
      ]
    },
    {
      "tag": "made",
      "patterns": [
        "how they made you?",
        "How they created you?",
        "how they build you"
      ],
      "responses": [
        "They build me using a CNN or convolutional neural networks. CNNs can automatically learn and extract features from images, making them highly effective in tasks like image classification. By training a CNN on a dataset of labeled images, the network can learn to identify patterns and features that distinguish one class from another. Did you know I'm also made of CNN ",
        "The incorporation of CNNs in my design empowered me to automatically discern unique attributes and patterns within images, enhancing my image recognition capabilities."
      ]
    },
    {
      "tag": "image_classification",
      "patterns": [
        "what is image_classification",
        "what is imageclassification",
        "what is image classification?",
        "what is image classification anyway?"
      ],
      "responses": [
        "Image classification, on the other hand, is a computer vision task that involves categorizing or labeling images into predefined classes or categories. The goal is to teach a computer to recognize and assign a specific label to an image based on its content. Image classification is widely used in various applications, such as object recognition, face detection, medical image analysis, autonomous vehicles, and more.",
        " Image classification is a computer vision task that involves labeling images into specific categories, often using deep learning techniques like CNNs."
      ]
    },
    {
      "tag": "developer",
      "patterns": [
        "who develop you?",
        "who is the developer of you?",
        "who are the developer of you?",
        "who made you?"
      ],
      "responses": [
        "The creators of mine are Angelo C Adame and Mark Zxeyus Den De Guzman. They are a student of ISABELA STATE UNIVERSITY taking a Bachelor of Science in computer science ",
        "The minds behind this project, Angelo C Adame and Mark Zxeyus Den De Guzman, are both students at ISABELA STATE UNIVERSITY, where they are studying computer science.",
        "This project was developed by Angelo C Adame and Mark Zxeyus Den De Guzman, who are currently undergraduates at ISABELA STATE UNIVERSITY, majoring in computer science."
      ]
    },
    {
      "tag": "corn",
      "patterns": ["what is corn?", "corn?"],
      "responses": [
        "Corn, also known as maize (scientific name: Zea mays), is a cereal grain and one of the most widely grown and important crops in the world. It is a staple food in many countries and has a wide range of uses. Corn is believed to have originated in the Americas and has been cultivated for thousands of years.",
        "Corn is a versatile and important crop that has been cultivated and consumed by people for centuries. It plays a significant role in agriculture, food production, and various industries around the world."
      ]
    },
    {
      "tag": "history",
      "patterns": ["What is the history of corn?", "history of corn"],
      "responses": [
        "Corn was originally domesticated in Mexico by native peoples by about 9,000 years ago. They used many generations of selective breeding to transform a wild teosinte grass with small grains into the rich source of food that is modern Zea mays",
        "Scientists believe people living in central Mexico developed corn at least 7000 years ago. It was started from a wild grass called teosinte."
      ]
    },
    {
      "tag": "blight",
      "patterns": [
        "what is corn blight",
        "what is NCLB",
        "blight on leaf",
        "blight?"
      ],
      "responses": [
        "Northern corn leaf blight  is a plant disease that affects corn crops, causing significant damage to the plants and leading to reduced yields and economic losses for farmers; it can be caused by various pathogens, including fungi and bacteria.",
        "Northern Corn Leaf Blight  is a plant ailment that impacts corn crops, resulting in substantial harm to the plants and resulting in diminished harvests and financial setbacks for farmers. It can be instigated by a range of pathogens, encompassing fungi and bacteria"
      ]
    },
    {
      "tag": "Setosphaeria_turcica",
      "patterns": [
        "what is Setosphaeria turcica",
        "Setosphaeria turcica?",
        "what is Setosphaeriaturcica"
      ],
      "responses": [
        "Setosphaeria turcica is a fungal pathogen known for causing Northern corn leaf blight in maize (corn) plants.",
        "This disease can lead to significant damage to corn crops, resulting in reduced yields and economic losses for farmers. The fungus primarily affects the leaves of the corn plants and can cause characteristic elongated lesions with dark borders."
      ]
    },
    {
      "tag": "symptoms_blight",
      "patterns": [
        "symptoms  OF BLIGHT IN CORN LEAF",
        "what are the symptoms of blight? ",
        "what are Symptoms of blight",
        "Symptoms of blight",
        "Symptoms of blight on corn leaf"
      ],
      "responses": [
        "The symptoms of blight in corn leaves, particularly Northern corn leaf blight caused by the fungus Setosphaeria turcica, manifest as elongated lesions with dark, tan, or grayish centers and a characteristic dark border, running parallel to the veins of the corn leaf. These lesions can extensively blight the leaves, reducing photosynthesis and overall plant health, potentially leading to significant reductions in corn yields and economic losses for farmers. In advanced stages, spore-bearing structures (pycnidia) may develop within the lesions. The disease can also affect other parts of the corn plant, including tassels and husks, and severe infestations can result in stunted growth and premature plant death. Monitoring and implementing management strategies, such as using resistant corn varieties and fungicides, are crucial for mitigating its impact on corn crops."
      ]
    },
    {
      "tag": "cure_blight",
      "patterns": [
        "what is cure of NCLB?",
        "what is cure of blight?",
        "what is medicine of blight?",
        "How to  management and control of blight in corn leaf? "
      ],
      "responses": [
        "Treating northern corn leaf blight involves using fungicides. For most home gardeners this step isn't needed, but if you have a bad infection, you may want to try this chemical treatment. The infection usually begins around the time of silking, and this is when the fungicide should be applied. Delaro® 325 SC Fungicide and Delaro® Complete Fungicide are both labeled for the control of NCLB. The labels state that either product can be sprayed when the disease first appears. With the use of Delaro® 325 SC Fungicide, if disease development persists a second application can be made at a 7- to 14-day interval.",
        "A general recommendation for corn foliar diseases caused by fungal pathogens is to consider a fungicide application if a disease is present on the third leaf below the ear leaf or higher on 50% of the plants at tasseling and if the product is susceptible to the disease. Both Delaro® 325 SC Fungicide and Delaro® Complete Fungicide are approved for managing NCLB (Northern Corn Leaf Blight). According to their labels, either of these products can be applied as soon as the disease becomes apparent. In the case of Delaro® 325 SC Fungicide, if the disease continues to progress, a second application can be administered with a 7- to 14-day gap."
      ]
    },
    {
      "tag": "cause_blight",
      "patterns": [
        "Cause of blight in corn leaf",
        "what is the Cause of blight in corn leaf",
        "what are the Cause of blight in corn leaf"
      ],
      "responses": [
        "Blight in corn leaves can be caused by several different pathogens, with the two most common culprits being fungal diseases and bacterial diseases."
      ]
    },
    {
      "tag": "effect_blight",
      "patterns": [
        "effects of blight in corn leaf",
        "effects of blight",
        "what is the effect of blight in corn leaf",
        "what are the effect of blight in corn leaf"
      ],
      "responses": [
        "NCLB can reduce yield when conditions are favorable for early development of the disease. Lesions reduce the leaf area of the plant that carries out photosynthesis.",
        "The more lesions on a plant and the earlier in the season the lesions develop, the greater the loss of photosynthet- ic area.?"
      ]
    },
    {
      "tag": "history_blight",
      "patterns": [
        "history of blight in corn leaf",
        "history of blight",
        "what is the history of blight in corn leaf",
        "what are the history of blight in corn leaf"
      ],
      "responses": [
        "The disease, which first appeared in the United States in 1968, reached epidemic status in 1970 and destroyed about 15% of the corn belt's crop production that year. In 1970 the disease began in the southern United States and by mid-August had spread north to Minnesota and Maine.",
        "This pathogen was first described in the early 1900s in the United States. It causes characteristic cigar-shaped lesions on corn leaves."
      ]
    },
    {
      "tag": "healthy",
      "patterns": ["What is the meaning of healthy corn?", "healthy corn?"],
      "responses": [
        "Healthy corn refers to corn plants that are in a robust, disease-free, and vigorous condition, exhibiting optimal growth and development.",
        "Achieving and maintaining healthy corn crops require proper agronomic practices, such as soil preparation, crop rotation, pest and disease management, irrigation, and fertilization. Monitoring the field and responding to any emerging issues promptly is essential to ensure that the corn crop remains healthy and reaches its full yield potential."
      ]
    },
    {
      "tag": "grayspot",
      "patterns": [
        "what is gray spot in corn leaf?",
        "gray spot in corn leaf?",
        " gray spot"
      ],
      "responses": [
        "Grey leaf spot is a foliar fungal disease that affects maize, also known as corn. GLS is considered one of the most significant yield-limiting diseases of corn worldwide. There are two fungal pathogens that cause GLS: Cercospora zeae-maydis and Cercospora zeina.",
        "A gray spot on a corn leaf could be indicative of various issues, such as disease or pest damage. Without more specific information or a visual inspection, it's challenging to pinpoint the exact cause of the gray spot. "
      ]
    },
    {
      "tag": " foliar fungal ",
      "patterns": [
        " what is foliar fungal on corn?",
        " foliar fungal?",
        "what is foliar fungal ?"
      ],
      "responses": [
        "Foliar fungal diseases are a group of plant diseases that affect the leaves of various crops and ornamental plants. ",
        "These diseases are caused by fungal pathogens that infect and damage the leaves, often leading to characteristic symptoms such as spots, lesions, discoloration, and in severe cases, leaf death. "
      ]
    },
    {
      "tag": "cure_grayspot",
      "patterns": [
        "what is cure of gray spot?",
        "what is cure for gray spot?",
        "what is medicine for gray spot?",
        "How to  management and control of gray spot in corn leaf? "
      ],
      "responses": [
        "Farmers must consider the cost of the application and market value of their corn before determining if fungicides will be an economical solution to GLS(gray leaf spot).",
        "Managing leaf wetness is an effective means for minimizing gray leaf spot in all hosts. Schedule irrigation early in the morning, before sunrise, and never in the late afternoon or evening. Prune or remove trees, shrubs, or other barriers to increase air movement and sunlight penetration."
      ]
    },
    {
      "tag": "cause_grayspot",
      "patterns": [
        "Cause of gray spot in corn leaf",
        "what is the Cause of gray spot in corn leaf",
        "what are the Cause of gray spot in corn leaf",
        "cause of gray spot"
      ],
      "responses": [
        "Gray leaf spot (GLS) is primarily caused by the fungal pathogen Cercospora zeae-maydis. This disease affects corn (maize) plants, leading to characteristic gray to tan-colored lesions with dark borders on the leaves. ",
        "Gray leaf spot, caused by the fungus Cercospora zeae-maydis, occurs virtually every growing season. If conditions favor disease development, economic losses can occur. Symptoms first appear on lower leaves about two to three weeks before tasseling."
      ]
    },

    {
      "tag": "effect_grayspot",
      "patterns": [
        "effects of gray spot in corn leaf",
        "effects of gray spot",
        "what is the effect of gray spot in corn leaf",
        "what are the effect of gray spot in corn leaf"
      ],
      "responses": [
        "Gray leaf spot reduces an ear's photosynthetic area, the number of kernels per ear also are reduced, resulting in yield loss.",
        "Severe outbreaks of Gray leaf spot can result in losses resulting from reduced photosynthesis and grain fill "
      ]
    },
    {
      "tag": "history_grayspot",
      "patterns": [
        "history of gray spot on corn leaf",
        "history of gray spot",
        "what is the history of gray spot on corn leaf",
        "what are the history of gray spot on corn leaf"
      ],
      "responses": [
        "Gray leaf spot, caused by the fungus Cercospora zeae maydis is the most significant yield-limiting disease of corn worldwide. The disease was first reported in Illinois in 1924, and has increased in prevalence throughout corn growing regions since 1988.",
        "Its history is relatively recent, as it was first recognized as a distinct disease in the late 1970s and has since become a major concern for corn growers, particularly in regions with warm and humid climates."
      ]
    },
    {
      "tag": "symptoms_grayspot",
      "patterns": [
        "symptoms  OF gray spot IN CORN LEAF",
        "what are the symptoms of gray spot? ",
        "what are Symptoms of gray spot",
        "Symptoms of gray spot",
        "Symptoms of gray spot on corn leaf"
      ],
      "responses": [
        "Symptoms of gray leaf spot are usually first noticed in the lower leaves. Initially, lesions of gray leaf spot begin as a small dot with a yellow halo. Lesions will elongate over time running parallel to the veins becoming pale brown to gray and rectangular in shape with blunt ends.",
        "Symptoms include small, rectangular to elongated gray to tan lesions with parallel sides on corn leaves. These lesions interfere with photosynthesis, leading to reduced plant health and premature leaf death. "
      ]
    },
    {
      "tag": "commonrust",
      "patterns": [
        "What is common rust?",
        "common rust?",
        "What is common rust on corn leaf?"
      ],
      "responses": [
        "Common rust causes elongated pustules on both leaf surfaces that range in colour from rust to dark brown. Cinnamon-brown urediniospores, often known as rust spores, are present in the pustules. Older pustules get darker. Sheaths can get diseased, much like the leaves themselves. Dead leaves or chlorosis may appear under extreme circumstances.",
        "Corn (maize) plants are susceptible to a fungal disease called Puccinia sorghi, which is technically known as common rust in corn. It is among the most common and well-known maize diseases. If common rust is not controlled, it can seriously harm maize harvests."
      ]
    },
    {
      "tag": "cause_commonrust",
      "patterns": [
        "Cause of Common rust in corn leaf",
        "what is the Cause of Common rust in corn leaf",
        "what are the Cause of Common rust on corn leaf",
        "cause of Common rust"
      ],
      "responses": [
        "Common rust is caused by the fungus Puccinia sorghi. Late occurring infections have limited impact on yield.",
        "Common rust in corn (Puccinia sorghi) is caused by a fungal pathogen. The primary cause of common rust is the fungus Puccinia sorghi. "
      ]
    },
    {
      "tag": "Puccinia_sorghi",
      "patterns": [
        "what is Puccinia sorghi?",
        "Puccinia sorghi",
        "Puccinia",
        "what is Puccinia ",
        "what is Puccinia sorghi on corn leaf"
      ],
      "responses": [
        "A fungal infection called Puccinia sorghi is responsible for common rust in maize plants. Puccinia sorghi, the culprit behind common rust, is a common and very consequential disease in maize farming. ",
        "Late occurring infections have limited impact on yield. The fungus overwinters on plants in southern states and airborne spores are wind-blown to northern states during the growing season. Disease development is favored by cool, moist weather (60 – 70◦ F)."
      ]
    },
    {
      "tag": "symptoms_commonrust",
      "patterns": [
        "symptoms  OF Common rust IN CORN LEAF",
        "what are the symptoms of Common rust? ",
        "what are Symptoms of Common rust",
        "Symptoms of Common rust",
        "Symptoms of Common rust on corn leaf"
      ],
      "responses": [
        "Symptoms of common rust frequently occur after silking. Small, round to elongate brown pustules occur on both leaf surfaces and other above ground sections of the plant. As the pustules grow they become brown to black. If illness is severe, the leaves may yellow and die early.      ",
        "Its symptoms include small pustules on leaves that start yellow or orange and turn reddish-brown to black, along with rusty spore masses. Common rust can reduce photosynthesis, cause leaf discoloration, and lead to early leaf aging. "
      ]
    },
    {
      "tag": "cure_commonrust",
      "patterns": [
        "what is cure of gCommon rust ?",
        "what is cure for Common rust ?",
        "what is medicine for Common rust ?",
        "How to  management and control of Common rust  in corn leaf? "
      ],
      "responses": [
        "Fungicides have been used against both common and southern rust, but they are usually not needed in maize because of the resistance bred into commercial varieties. However, foliar fungicides may have a use on sweet corn. A number of protectant fungicide have been recommended: e.g., chlorothalonil and mancozeb.",
        "The best management practice is to use resistant corn hybrids. Fungicides can also be beneficial, especially if applied early when few pustules have appeared on the leaves."
      ]
    },
    {
      "tag": "effect_commonrust",
      "patterns": [
        "effects of gray spot in corn leaf",
        "effects of gray spot",
        "what is the effect of gray spot in corn leaf",
        "what are the effect of gray spot in corn leaf"
      ],
      "responses": [
        "Gray leaf spot lesions on corn leaves hinder photosynthetic activity, reducing carbohydrates allocated towards grain fill. The extent to which gray leaf spot damages crop yields can be estimated based on the extent to which leaves are infected relative to grainfill",
        "Gray leaf spot, caused by the fungus Cercospora zeae-maydis, is a common foliar disease in corn (maize) plants. This disease can have several negative effects on corn crops,"
      ]
    }
  ]
}
